'''
3 основных принципа ООП:

    - инкапсуляция
    - наследование
    - полиморфизм

Инкапсуляций = не только размещение методов (и данных) внутри одного объекта (класса), но и скрытие их от пользователя.
Т.е. инкапсуляция это такие методы, к которым нельзя напрямую обратиться, но они работают внутри класса.

Наследование = хранение общих данных или методов в классе-родителе.

Полиморфизм = способность единым образом работать с разными типами данных. Полиморфизм предполагает, что можно создать
базовый класс с базовым методом, унаследовать от него дочерние и дополнить базовый метод доп.функционалом, присущим
конкретному дочернему классу.
'''