import numpy as np


a = np.array([1,2,3])
print(a * 2)  # [2 4 6] – математические операции происходят не как со списками
print(a + 1)  # [2 3 4]
print(1 + a)  # [2 3 4]
print(a / 2)  # [0.5 1.  1.5]
print(2 / a)  # [2.         1.         0.66666667]
print(a - 2)  # [-1  0  1]
print(a // 2)  # [0 1 1]
print(a ** 2)  # [1 4 9]
print(a % 2)  # [1 0 1]

print(-a)  # [-1 -2 -3]
print(a + a)  # [2 4 6]
print(2 / a)


b = np.array([2,3,4])
print(a + b)  # [3 5 7]


'''Массивы должны быть согласованы по размеру, те нельзя поделить массив 1х3 на массив 1х4. Но можно использовать
массивы 1х3 и 2х3, где количества строк совпадают:'''

a = np.array([1,2,3])
b = np.arange(1,7)
b.resize(2,3)
# [[1 2 3]
#  [4 5 6]]

print(a + b)
# [[2 4 6]
#  [5 7 9]]


a = np.arange(1, 19)
a.resize(3, 3, 2)
print(a)
# [[[ 1  2]
#   [ 3  4]
#   [ 5  6]]
#
#  [[ 7  8]
#   [ 9 10]
#   [11 12]]
#
#  [[13 14]
#   [15 16]
#   [17 18]]]

b = np.ones((3, 2))
print(b)
# [[1. 1.]
#  [1. 1.]
#  [1. 1.]]

print(a+b)
# [[[ 2.  3.]
#   [ 4.  5.]
#   [ 6.  7.]]
#
#  [[ 8.  9.]
#   [10. 11.]
#   [12. 13.]]
#
#  [[14. 15.]
#   [16. 17.]
#   [18. 19.]]]


'''Можно использовать операции присвоения, например +=, вместо того, чтобы писать а = а + b:'''

a = np.array([1,2,3])
b = np.array([3,3,3])
a += b
print(a)  # [4 5 6]