import numpy as np


a = np.array([1,2,3])  # список
print(a)

a = np.array((1,2,3))  # кортеж
print(a)

a = np.array( 'Hello' )  # массив из 1 элемента
print(a)


a = np.array([[1, 2], [3, 4], [5, 6]])  # многомерный массив
print(a)

'''* нельзя делать матрицу неправильного рамера : ([[1, 2], [3, 4], [5, 6, 7]])'''


'''Трехмерный массив'''

b = np.array([[[1, 2], [3, 4]], [[5, 6], [7, 8]], [[9, 10], [11, 12]]])
print('\n')
print(b)

print('Первый двумерный срез:')
print(b[0])

print('Первая строка первого среза:')
print(b[0,0])